Tekla.Structures.ModelInternal.dotGetProperties_t


Tekla.Structures.ModelInternal.dotGetProperties_t.aName0
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName1
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName2
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName3
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName4
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName5
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName6
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName7
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName8
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.aName9
Name of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.Type
Type of the property

Tekla.Structures.ModelInternal.dotGetProperties_t.Source
Where to get the property (UDA/Report/AllUDAs)

Tekla.Structures.ModelInternal.dotGetProperties_t.FatherId
ID of the part whose property we wish to get or set

Tekla.Structures.ModelInternal.dotGetProperties_t.InitializeTable
Used for initialization of PropertyTable 1= initialize, 0= don't

Tekla.Structures.ModelInternal.dotGetProperties_t.nProperties
Number of properties

Tekla.Structures.ModelInternal.dotGetProperties_t.aSuccess
0 or 1, to determine if the value was retrieved successfully

Tekla.Structures.ModelInternal.dotGetProperties_t.aIntValues
Integer return values

Tekla.Structures.ModelInternal.dotGetProperties_t.aDoubleValues
Double return values

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue0
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue1
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue2
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue3
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue4
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue5
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue6
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue7
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue8
String return value

Tekla.Structures.ModelInternal.dotGetProperties_t.aStringValue9
String return value